In [1]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
host="localhost",
user="root",
password="root",
database="sakila"
)
mycursor = mydb.cursor()
mycursor.execute("select * from actor;")
myresult = mycursor.fetchall()
df = pd.DataFrame(myresult)
print(df)

       0         1             2                   3
0      1  PENELOPE       GUINESS 2006-02-15 04:34:33
1      2      NICK      WAHLBERG 2006-02-15 04:34:33
2      3        ED         CHASE 2006-02-15 04:34:33
3      4  JENNIFER         DAVIS 2006-02-15 04:34:33
4      5    JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..   ...       ...           ...                 ...
195  196      BELA        WALKEN 2006-02-15 04:34:33
196  197     REESE          WEST 2006-02-15 04:34:33
197  198      MARY        KEITEL 2006-02-15 04:34:33
198  199     JULIA       FAWCETT 2006-02-15 04:34:33
199  200     THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

C:\Users\heind\AppData\Local\Temp\ipykernel_21044\3608723168.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [6]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
host="localhost",
user="root",
password="root",
database="customer"
)
mycursor = mydb.cursor()
mycursor.execute("select * from books;")
myresult = mycursor.fetchall()
df = pd.DataFrame(myresult)
print(df)

   0                  1        2       3   4
0  1       Harry Potter  FT-1234  100.00  10
1  2      Perahu Kertas  FT-1235  100.00   3
2  3  Malam Minggu Miko  FT-1236  100.00   8
3  4      Salmon Goreng  FT-1237  100.00   7

In [7]:
sql = "INSERT INTO books (title, isbn, stock) VALUES (%s, %s,%s)"
val = [
  ('beruang kutub', 'bg1234', 15)
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [8]:
sql = "UPDATE books SET stock = 10 WHERE title = 'beruang kutub'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

In [9]:
sql = "DELETE FROM books WHERE title = 'beruang kutub'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

In [10]:
df.dtypes

0     int64
1    object
2    object
3    object
4     int64
dtype: object

In [11]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
host="localhost",
user="root",
password="root",
database="sakila"
)
mycursor = mydb.cursor()
mycursor.execute("select first_name from actor where last_name like 'be%';")

myresult = mycursor.fetchall()
df = pd.DataFrame(myresult)
print(df)

             0
0     SCARLETT
1      MICHAEL
2       VIVIEN
3         LIZA
4         KARL
5        HENRY
6  CHRISTOPHER

In [20]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
host="localhost",
user="root",
password="root",
database="sakila"
)


mycursor = mydb.cursor()
mycursor.execute("select a.address, b.city from address a inner join city b on a.city_id=b.city_id where b.city_id<60 ")
    

myresult = mycursor.fetchall()
df = pd.DataFrame(myresult)
print(df)

                                    0                        1
0                939 Probolinggo Loop     A Coruña (La Coruña)
1               733 Mandaluyong Place                     Abha
2                535 Ahmadnagar Manor                Abu Dhabi
3            1789 Saint-Denis Parkway                    Acuña
4            663 Bahía Blanca Parkway                    Adana
5                 614 Pak Kret Street              Addis Abeba
6                       751 Lima Loop                     Aden
7                     230 Urawa Drive                    Adoni
8                 922 Vila Velha Loop               Ahmadnagar
9               923 Tangail Boulevard                 Akishima
10             98 Pyongyang Boulevard                    Akron
11                 669 Firozabad Loop                   al-Ayn
12            1124 Buenaventura Drive                al-Hawiya
13             1759 Niznekamsk Avenue                al-Manama
14          1152 Citrus Heights Manor               al-Qadarif
15              289 Santo André Manor                 al-Qatif
16          127 Purnea (Purnia) Manor              Alessandria
17               431 Xi´angtan Avenue    Allappuzha (Alleppey)
18               397 Sunnyvale Avenue                  Allende
19               1623 Kingstown Drive          Almirante Brown
20         1407 Pachuca de Soto Place                 Alvorada
21                    1014 Loja Manor                 Ambattur
22                992 Klerksdorp Loop               Amersfoort
23                   949 Allende Lane                   Amroha
24                 1354 Siegen Street           Angra dos Reis
25                  356 Olomouc Manor                 Anápolis
26               1718 Valencia Street              Antofagasta
27                 1201 Qomsheh Manor     Aparecida de Goiânia
28                  1749 Daxian Place                Apeldoorn
29                      1692 Ede Loop                Araçatuba
30          334 Munger (Monghyr) Lane                     Arak
31                 1009 Zanzibar Lane                  Arecibo
32   913 Coacalco de Berriozábal Loop                Arlington
33                    659 Vaduz Drive                   Ashdod
34               387 Mwene-Ditu Drive                 Ashgabat
35      632 Usolje-Sibirskoje Parkway                 Ashqelon
36               201 Effon-Alaiye Way                 Asunción
37                  692 Joliet Street                  Athenai
38                 616 Hagonoy Avenue                  Atšinsk
39   125 Città del Vaticano Boulevard                  Atlixco
40                   1308 Arecibo Way  Augusta-Richmond County
41                 587 Benguela Manor                   Aurora
42                   43 Vilnius Manor                   Aurora
43      1229 Varanasi (Benares) Manor               Avellaneda
44                       1190 0 Place                     Bagé
45    1427 A Coruña (La Coruña) Place             Bahía Blanca
46                183 Haiphong Street                 Baicheng
47                    362 Rajkot Lane                   Baiyin
48          431 Székesfehérvár Avenue                     Baku
49  1697 Kowloon and New Kowloon Loop                 Balašiha
50                1912 Emeishan Drive                Balikesir
51               624 Oshawa Boulevard                Balurghat
52                1641 Changhwa Place                  Bamenda
53                1370 Le Mans Avenue      Bandar Seri Begawan
54                 247 Jining Parkway                   Banjul
55        502 Mandi Bahauddin Parkway                Barcelona
56                    915 Ponce Place                    Basel
57          1542 Lubumbashi Boulevard                  Bat Yam
58                  29 Pyongyang Loop                   Batman
59             1924 Shimonoseki Drive                    Batna